{
  "title": "Jan 25: {N} Stanford SURF application",
  "cells": [
    {
      "type": "markdown",
      "data": "# Education and Experience"
    },
    {
      "type": "markdown",
      "data": "\nPlease list all relevant research experience (research institution, research program, research advisor, department title, research period, title/subject of investigation): * \n\nResearch Institution: Columbia University\nResearch Advisor: Nakul Verma\nResearch Period: January 2019 - Present\nProject: Developing an Infinite-Dimensional Latent Space \n\nResearch Institution: Columbia Robotics Lab\nResearch Advisor: Peter Allen\nResearch Period: June 2018 - present\nProject: Human-in-the-loop Training for Autonomous Navigation and Grasping. \nProject: Teleoperation with sEMG Data \n\nResearch Institution: LinkedIn\nResearch Advisor: Mohsen Jamali\nResearch Period: May 2018 - September 2018\nProject: Image Embeddings Capturing Semantic Content for Click-Through-Rate Prediction \n\nResearch Institution: Columbia Data Science Institute - Wu Lab \nResearch Advisor: Eugene Wu\nResearch Period: Fall 2017 - Summer 2018\nProject: Deep Neural Inspection (DNI).\n\nResearch Institution: Intel, Artificial Intelligence Products Group \nResearch Advisor: Hanlin Tang\nResearch Period: June 2017 - September 2017\nProject: Single-Shot Detection with Pose Prediction\n\nResearch Institution: Intelligent Computing and Machine Learning Lab (ICMLL)\nResearch Advisor: Zengchang Qin\nResearch Period: Fall 2014 - Summer 2015\nProject: Computer-Aided Diagnosis of Heart Transplants Rejection using Graph-Based Features\n\nResearch Institution: Intelligent Computing and Machine Learning Lab (ICMLL)\nResearch Advisor: Zengchang Qin\nResearch Period: Fall 2013 - Summer 2014\nProject: Autogeneration of High-efficiency Transportation Networks \n"
    },
    {
      "type": "markdown",
      "data": "Please list seven School of Engineering faculty with whom you would like to conduct research: \n\nEmma Brunskill\nSilvio Savarese \nJuan Carlos Niebles \nDorsa Sadigh \nFeifei Li\nJeanette Bohg\nSabastian Thrun\n\n"
    },
    {
      "type": "markdown",
      "data": "Please list all computer languages and programming experience (e.g. Matlab, Python, Java, etc.):\n\nPython - Implemented, trained, tested (and in some cases, visualized) many machine learning models in Tensorflow, Pytorch and Keras for most research projects. Have worked in Python for data processing and data analysis at both my internships a data science intern at Intel and an ML engineering intern at LinkedIn. Also have done numerous personal projects with Python.\nMatlab - Implemented Support Vector Machine, graph algorithms and image processing pipelines to classify heart transplant rejection projects. Also wrote code to implement a system that autogenerates high-efficiency transportation networks given constraints.\nC/C++ - Implemented a server to host a website from scratch using the C's socket library functions.\nJava - Mainly from classroom experience.\nApache Pig and Hadoop - Used to manipulate big data for machine learning purposes at LinkedIn \n\n"
    },
    {
      "type": "markdown",
      "data": "# Statement of intent\nGeneral points:\n\n## Machine Learning\n- Past research projects like classification of heart transplant rejection using histopathological images and graph-based features. [+ associated honors and results.] Machine Learning engineering internships (intel and LinkedIn), applying machine learning models to computers. Frustrations with the massive need for data, related to Halevy et. al.'s \"The Unreasonable Effectiveness of Data\".\n- Frustration with paradigm, set out explore better ways of training computers. Fundamentally believe that humans have a larger part to play in the training of computers. I draw from the analogy of teaching children. It's much more important that they have learned the logic than classification accuracy over very few samples. This leads to two different questions: How do we extract the logic out of the neural networks, and how do we embed such logic in them?\n- In my effort to answer the first question, I worked with Professor Eugene Wu at Columbia's Data Science Institute on Deep Neural Inspection, a project that aimed to verify whether a Deep Neural Network is learning the \"correct\" rules. I furthermore investigated the feasibility of translating RNN's into FSM's to heighten their interpretability. (designing experiments: We design the system to identify and locate the neurons whose firings correlate highly with the proposed hypothesis function. ablasion studies on RNN's trained on regular expressions, and comparisons to show the efficacy of the system.)\n\n- In my effort to asnwer the second question, I worked with Professor Peter Allen at the Columbia Robotics Lab under a group that aims to better improve human-in-the-loop for training a robot to autonomously navigate an environment. [Introduce current concept of using eye-tracking data to embed higher-level reasoning into computer vision systems.]\n- Currently also working with Professor verma to create an infinite dimensional latent space that can expand. A peice of theoretical work that may have implications in the lifelong learning that has to happen because of the temporal nature of human computer interactions.\n\n- Dream is to be able to create a new and more data-efficient way for robotic systems or other artificially intelligent systems to learn by interacting with humans. I know that we've only begun to scrape the surface of this problem, and would love to dedicate my next summer making progress in this area.\n\n## Clarify the direction\nHuman computer interactive learning, lifelong learning, meta learning, curriculum learning, transfer learning, in the context of computer vision for the application of robotics.\n\n## Miscellaneous\n- Current work on classifying hand primitives through deep learning. [Should I even talk about this?]\n- Mathematical training? Looking at things from a \n- What is the next levels of computer vision? What's the vision of the future?\n- Responsibility of a researcher to do something about what's missing in the field.\n- Fear of AI stems from mystery of its workings, but we can created\n\n\n\n\n"
    }
  ]
}