{
  "title": "Mar 9: {E} Email to Maria-Florina Balcan",
  "cells": [
    {
      "type": "markdown",
      "data": "Hi Professor Balcan,\n\nMy name is Ian Huang, and I'm a student at Columbia studying Applied Mathematics and Computer Science. From my research in vision and robotics at Peter Allen's lab, I'm familiar with the work that your lab does, and I'm very interested in getting involved at your lab this summer!\n\nI'm currently working on several different projects – including decyphering human grasp intention using deep learning applied on sEMG data (under Prof. Allen), data augmentation to counteract catastrophic forgetting (under Prof. Carl Vondrick), and a more theory-heavy project on embedding multiple latent hierarchies in a fixed-dimensional hyperbolic space (under Prof. Nakul Verma). I've also previously worked at the Columbia Data Science Institute on a projects that sought to explain the behavior of Neural Networks, and worked at Intel and LinkedIn for research projects in computer vision. I've attached my CV here with more about my research experience – if you have a moment, please do take a look!\n\nI've had a chance to look through your recent publications, and I'd love to work with you on projects related to life-long learning and learning representations. While my research project on lifelong learning is more applied, my research on learning representation for hierarchical data in hyperbolic spaces is more theoretical, and I think it's the combination of practice and theory that would make me a good fit for your research group.\n\nWhile my interests lie largely in lifelong learning and learning representation, I would be very open to being assigned to new projects. I'm reaching out to you because of all the faculty at CMU, my interests align best with your lab's research direction. If you'd like a letter of recommendation from any advisors I currently work with, please let me know!\n\nI would love to be doing research at your lab this summer. Please let me know if that is a possibility!\n\nThanks so much,\nIan"
    }
  ]
}