{
  "title": "DayanAbbott: {N} 1.1 Introduction",
  "cells": [
    {
      "type": "markdown",
      "data": "## Properties of neruons\n- dendrites give inputs from other neurons\n- axons carry output to toher cells\n- _cortical pyramid_ neuron each receives thousands of synaptic inputs\n- cell body range in diameter from 10 to 50 micrometers\n- membrane-spanning ion channels allowing ions to flow: Na+, K+, Ca2+, and Cl-\n- Resting conditions, cell membrane is ~ -70 mV relative to surrounding bath\n- ion pumps in membrane mantain concentration gradients.\n- current of positively charged ions _out_ of the cell is called **hyperpolarization** (cell membrane potential becomes more negative). Current  lowing into the cell changes the membrane potential to less negative or even positive values (inflow of positive charges). This is **depolarization**.\n- When depolarized enough (over threshold), action potential happens.\n- Roughly 100 mV fluctuation in electrical potential across the cell membrane lasting for 1 ms.\n- **refractory period**: Right after action potential has been fired, for a few millisoconds it is impossible to initiate another spike.\n- **relative refractory period**: simply more difficult.\n- Axons terminate at synapses. Opens ion channels, prudincg influx of Ca2+ leading to release of neuro transmitter. Neurotransmitter binds to **postsynaptic** side of synapse, causing ion-conducting channels to open.\n- Synapsescan have excitatory (depolarizing) or inhibitory (typically hyperpolarizing) effect on postsynaptic neuron\n\n## Recording Neuronal Responses\n- Stick pin in cell, stick pin to the outside fluid. The soma (cell body) readings are the norm, intracellular dendritic readings are becoming more popular. But getting readings on axons is difficult.\n- Extracellular reading can only reveal AP fired by neuron, but not the subthreshold membrane potentials (why are these important?)\n- In vivo: extracellular is better. In vitro: intracellular can be done.\n\n# Stimulus to response\nNeurons respond by producing complex spike sequences based on intrinsic dynamics of neuron and temporal characteristics of stimulus. (depends both on its own state and its input.)\n\nWe cannot predict the timing deterministically because too many things affect that, even when provided the same stimulus. So we use probabilities."
    }
  ]
}